
# Вывести на экран строку Hello World
print('Hello World')


# Вывести на экран пять звездочек
print( str('*****') )



# Вывести на экран квадрат 5 на 5 заполненный символами '#'
a = '#####'

for i in range (5):
    print(a)